testZadanie.ЗагрузкаДанных/src/InformationRegisters/НастройкаЗапроса/НастройкаЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗапроса</name>
  <dimensions>
    <name>function</name>
    <type>
      <types>EnumRef.function</types>
    </type>
  </dimensions>
  <dimensions>
    <name>symbol</name>
    <type>
      <types>CatalogRef.Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>outputsize</name>
    <type>
      <types>EnumRef.Outputsize</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

testZadanie.ЗагрузкаДанных/src/InformationRegisters/ДанныеФондовогоРынка/ДанныеФондовогоРынка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФондовогоРынка</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>open</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>high</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>low</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>close</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Volume</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Компании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

testZadanie.ЗагрузкаДанных/src/CommonModules/ЗД_РаботаСРынком/Module.bsl
Процедура ОбновитьДанныеРынка() Экспорт  
	Выборка = ХранилищеОбщихНастроек.Выбрать(Новый Структура("КлючОбъекта,КлючНастроек","Апи","Ключ"));
	Выборка.Следующий();
	ТОкен = Выборка.Настройки;
	Заголовки = СтандартныеЗаголовки();    
	МассивДанных = Новый Массив;
	Параметры = РегистрыСведений.НастройкаЗапроса.ПолучитьСписокПараметров(); 
	Если Параметры.Количество() = 0 ТОгда
		ЗаписьЖурналаРегистрации("Обновление данных рынка",УровеньЖурналаРегистрации.Ошибка,,,"Не заполнены параметры получения данных в регистре ""НастройкаЗапроса"""); 
		возврат;	
	КонецЕсли;	
	Для Каждого Стр из Параметры Цикл 
		Результат = СформироватьЗапрос(Стр,Токен); 
		Если результат = "" Тогда
			Возврат;
		КонецЕсли;         
		Если Результат = Неопределено ТОгда
			ЗаписьЖурналаРегистрации("Апи",УровеньЖурналаРегистрации.Ошибка,,,"Закончились запросы");
			Продолжить;
		КонецЕсли;	   
		ДатаКлюч = Формат(НачалоДня(ТекущаяДата())-1,"ДФ=yyyy-MM-dd");
		ВчерашниеДанные = Результат.Получить(ДатаКлюч);  
		Если ВчерашниеДанные= Неопределено тОгда
			возврат;	
		КонецЕсли;	
		Структура = Новый Структура;
		Структура.Вставить("Компания",Стр.symbol);
		Структура.Вставить("Период",ДатаКлюч);
		Для Каждого ЭлементСоответствия из ВчерашниеДанные Цикл
			Структура.Вставить(Прав(ЭлементСоответствия.Ключ,СтрДлина(ЭлементСоответствия.Ключ)-1),ЭлементСоответствия.Значение);	
		КонецЦикла;	 
		
		МассивДанных.Добавить(Структура);
	КонецЦикла;
		РегистрыСведений.ДанныеФондовогоРынка.ЗаписатьДанные(МассивДанных);

	
КонецПроцедуры


Функция СтандартныеЗаголовки() 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	Заголовки.Вставить("Accept","*/*");
	Заголовки.Вставить("Connection","keep-alive");
	Заголовки.Вставить("Server", "cloudflare");
	возврат Заголовки;
	
	
КонецФУнкции 

Функция СформироватьЗапрос(Параметры,Токен)  
	Заголовки = СтандартныеЗаголовки();
	СтрокаУсловий = СтрШаблон("/query?function=%1&symbol=%2&apikey=%3&outputsize=%4",СтрЗаменить(Параметры.function," ","_"),СтрЗаменить(Параметры.symbol," ","."),Токен,Параметры.outputsize);  
	Запрос = Новый HTTPЗапрос(СтрокаУсловий,Заголовки);
	Соединение = Новый HTTPСоединение("www.alphavantage.co",,,,,,Истина); 
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		Возврат ДжейсонВСтруктуру(Ответ.ПолучитьТелоКакСтроку());	
	Иначе
		ЗаписьЖурналаРегистрации("Обновление данных рынка",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка при получение данных с сайта"); 
		Возврат "";
	КонецЕсли;	
КонецФУнкции      

Функция ДжейсонВСтруктуру(Тело) 
	//Тело = Справочники.Ответы.НайтиПоНаименованию("").Ответ; Для теста, после блока по квоте

	Форматная = СтрЗаменить(Тело,". ","");  
		
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Форматная);
	Соответствие = ПрочитатьJSON(Чтение,Истина);
	Чтение.Закрыть();
	Возврат Соответствие.Получить("Time Series (Daily)");
КонецФУнкции
